# DistributionOfNormals Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolymeshTopology..::..DistributionOfNormals Property
PolymeshTopology Class See Also
---
Indicates the distribution of normal vectors along the tessellated polymesh surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public DistributionOfNormals DistributionOfNormals { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DistributionOfNormals As DistributionOfNormals
	Get
```

Visual C++
---
```text
public:
property DistributionOfNormals DistributionOfNormals {
	DistributionOfNormals get ();
}
```

# See Also
PolymeshTopology Class
Autodesk.Revit.DB Namespace